import numpy as np

arr1 = np.array([1, 2, 3])
arr2 = np.array([1.1, 2.2, 3.3])
print(arr1)  # [1 2 3]
print(arr1.dtype)  # int32
print(arr2)  # [1.1 2.2 3.3]
print(arr2.dtype)  # float64
print(arr1 + arr2)  # [2.1 4.2 6.3]

print(arr2 * 10)  # [11. 22. 33.]

data1 = [[1, 2, 3], [4, 5, 6]]
print(data1)  # [[1, 2, 3], [4, 5, 6]]
print(type(data1))  # <class 'list'>
arr3 = np.array(data1)
# [[1 2 3]
#  [4 5 6]]
print(arr3)
print(arr3.dtype)  # int32

# [[0. 0. 0. 0. 0.]
#  [0. 0. 0. 0. 0.]
#  [0. 0. 0. 0. 0.]]
print(np.zeros((3, 5)))  # 3行5列数值为0的矩阵
# [[1. 1. 1. 1.]
#  [1. 1. 1. 1.]
#  [1. 1. 1. 1.]]
print(np.ones((3, 4)))  # 3行4列数值为1的矩阵
# [[[1. 1. 1. 1. 1.]
#   [1. 1. 1. 1. 1.]
#   [1. 1. 1. 1. 1.]
#   [1. 1. 1. 1. 1.]]
#
#  [[1. 1. 1. 1. 1.]
#   [1. 1. 1. 1. 1.]
#   [1. 1. 1. 1. 1.]
#   [1. 1. 1. 1. 1.]]
#
#  [[1. 1. 1. 1. 1.]
#   [1. 1. 1. 1. 1.]
#   [1. 1. 1. 1. 1.]
#   [1. 1. 1. 1. 1.]]]
print(np.ones((3, 4, 5)))  # 3*4*5 数值为1的三维矩阵
# [[[0. 0. 0. 0.]
#   [0. 0. 0. 0.]
#   [0. 0. 0. 0.]]
#
#  [[0. 0. 0. 0.]
#   [0. 0. 0. 0.]
#   [0. 0. 0. 0.]]]
print(np.empty((2, 3, 4)))  # 2*3*4 数值为空的三维矩阵  会随机设置值

arr4 = np.arange(10)
print(arr4)  # [0 1 2 3 4 5 6 7 8 9]
arr4[5:8] = 10  # arr4第6到第8位设置成10
print(arr4)  # [ 0  1  2  3  4 10 10 10  8  9]

arr4_copy = arr4.copy()  # 复制一个arr4的副本
arr4_copy[:] = 15  # arr4从第一位到最后以为设置为15
print(arr4_copy)  # [15 15 15 15 15 15 15 15 15 15]
print(arr4)  # [ 0  1  2  3  4 10 10 10  8  9]
